pioter77/stm32f411CE_desk_led_controller/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

#include "stm32f4xx_ll_adc.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_spi.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx_ll_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define REL2_Pin LL_GPIO_PIN_13
#define REL2_GPIO_Port GPIOC
#define LIGHT_SENS1_Pin LL_GPIO_PIN_1
#define LIGHT_SENS1_GPIO_Port GPIOA
#define SPI_CS_Pin LL_GPIO_PIN_4
#define SPI_CS_GPIO_Port GPIOA
#define REMOTE_IN3_Pin LL_GPIO_PIN_12
#define REMOTE_IN3_GPIO_Port GPIOB
#define REMOTE_IN3_EXTI_IRQn EXTI15_10_IRQn
#define REMOTE_IN2_Pin LL_GPIO_PIN_13
#define REMOTE_IN2_GPIO_Port GPIOB
#define REMOTE_IN2_EXTI_IRQn EXTI15_10_IRQn
#define REMOTE_IN1_Pin LL_GPIO_PIN_14
#define REMOTE_IN1_GPIO_Port GPIOB
#define REMOTE_IN1_EXTI_IRQn EXTI15_10_IRQn
#define REMOTE_IN0_Pin LL_GPIO_PIN_15
#define REMOTE_IN0_GPIO_Port GPIOB
#define REMOTE_IN0_EXTI_IRQn EXTI15_10_IRQn
#define REL1_Pin LL_GPIO_PIN_9
#define REL1_GPIO_Port GPIOA
#define REL0_Pin LL_GPIO_PIN_10
#define REL0_GPIO_Port GPIOA
#define ENCODER_DT2_Pin LL_GPIO_PIN_15
#define ENCODER_DT2_GPIO_Port GPIOA
#define ENCODER_CLK2_Pin LL_GPIO_PIN_3
#define ENCODER_CLK2_GPIO_Port GPIOB
#define ENCODER1_BTN_Pin LL_GPIO_PIN_5
#define ENCODER1_BTN_GPIO_Port GPIOB
#define ENCODER1_BTN_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
